user_service/src/main/java/ua/nure/xml/getUserRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getUserRequest>
            <gs:login>Yanov1</gs:login>
            <gs:password>qwerty</gs:password>
        </gs:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>